EventApp/app/Models/EventModel.php

    public function getAllDataJoin(){
        $query = $this->db->table("event")
            ->select("event.*, kategori.nama_catg, lokasi.nama_loc")
            ->join("kategori", "kategori.id_catg = event.id_catg")
            ->join("lokasi","lokasi.id_loc = event.id_loc");
            return $query->get()->getResultArray();
---
SELECT `event`.*, `kategori`.`nama_catg`
FROM `event`
JOIN `kategori` ON `kategori`.`id_catg` = `event`.`id_catg`
SELECT `event`.*, `kategori`.`nama_catg`, `lokasi`.`nama_loc`
FROM `event`
JOIN `kategori` ON `kategori`.`id_catg` = `event`.`id_catg`
JOIN `lokasi` ON `lokasi`.`id_loc` = `event`.`id_loc`

       public function getDataByID($id_event)
       {
           return $this->find($id_event);
---
SELECT *
FROM `event`
WHERE `event`.`id_event` = ' 1'