EventApp/app/Models/KategoriModel.php

    public function getAllData()
    {
      return $this->findAll();
---
SELECT *
FROM `kategori`