EventApp/app/Models/LokasiModel.php

    public function getAllData()
    {
      return $this->findAll();
---
SELECT *
FROM `lokasi`

     public function getDataByID($id_loc)
     {
         return $this->find($id_loc);
---
SELECT *
FROM `lokasi`
WHERE `lokasi`.`id_loc` = ' 2'