EventApp/app/Models/UserModel.php

	public function get_data($email, $password)
	{
      return $this->db->table('user')
      ->where(array('user_email' => $email, 'user_pass' => $password))
      ->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `user_email` = 'admin1@gmail.com'
AND `user_pass` = 'admin265'