EventApp/app/Controllers/Kategori.php

   public function nambah()
   {
       $validation = $this->validate([
           'nama_catg' => [
               'rules' => 'required',
               'errors' => [
                   'required' => 'Kolom Nama Harus diisi'
               ]
           ],
       ]);

       if (!$validation) {
           $errors = \Config\Services::validation()->getErrors();

           return redirect()->back()->withInput()->with('errors', $errors);
       }
       $data = [
           'nama_catg' => $this->request->getPost('nama_catg'),
       ];
       $this->kategori->save($data);
---
INSERT INTO `kategori` (`nama_catg`) VALUES ('Wibu')

    public function edit()
    {
        $validation = $this->validate([
            'nama_catg' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kolom Nama Harus diisi'
                ]
            ],
        ]);

        if (!$validation) {
            $errors = \Config\Services::validation()->getErrors();

            return redirect()->back()->withInput()->with('errors', $errors);
        }
        $kategori = $this->kategori->find($this->request->getPost('id_catg'));

        $data = [
            'id_catg' => $this->request->getPost('id_catg'),
            'nama_catg' => $this->request->getPost('nama_catg'),
        ];
        $this->kategori->save($data);
---
SELECT *
FROM `kategori`
WHERE `kategori`.`id_catg` = '8'
UPDATE `kategori` SET `nama_catg` = 'Wibu Banget'
WHERE `kategori`.`id_catg` IN ('8')