EventApp/app/Controllers/Lokasi.php

    public function destroy($id_loc)
    {
        $this->lokasi->delete($id_loc);
---
DELETE FROM `lokasi`
WHERE `id_loc` IN ('12')

                $data['cover'] = $imageName;
            }

            $this->lokasi->save($data);
---
INSERT INTO `lokasi` (`nama_loc`) VALUES ('Lampung City Mall euy')